shangdawei/FT232R_Emulator/MCU/STM32F0XX/Library/CMSIS/stm32f0xx_0.h
/* Aliases for __IRQn */
#define ADC1_IRQn                ADC1_COMP_IRQn
#define DMA1_Channel1_IRQn       DMA1_Ch1_IRQn
#define DMA1_Channel2_3_IRQn     DMA1_Ch2_3_DMA2_Ch1_2_IRQn
#define DMA1_Channel4_5_6_7_IRQn DMA1_Ch4_7_DMA2_Ch3_5_IRQn
#define DMA1_Channel4_5_IRQn     DMA1_Ch4_7_DMA2_Ch3_5_IRQn
#define RCC_IRQn                 RCC_CRS_IRQn
#define TIM6_IRQn                TIM6_DAC_IRQn
#define USART3_4_IRQn            USART3_8_IRQn
#define USART3_6_IRQn            USART3_8_IRQn
#define PVD_IRQn                 VDDIO2_IRQn
#define PVD_VDDIO2_IRQn          VDDIO2_IRQn
/* Aliases for __IRQHandler */
#define ADC1_IRQHandler                ADC1_COMP_IRQHandler
#define DMA1_Channel1_IRQHandler       DMA1_Ch1_IRQHandler
#define DMA1_Channel2_3_IRQHandler     DMA1_Ch2_3_DMA2_Ch1_2_IRQHandler
#define DMA1_Channel4_5_6_7_IRQHandler DMA1_Ch4_7_DMA2_Ch3_5_IRQHandler
#define DMA1_Channel4_5_IRQHandler     DMA1_Ch4_7_DMA2_Ch3_5_IRQHandler
#define RCC_IRQHandler                 RCC_CRS_IRQHandler
#define TIM6_IRQHandler                TIM6_DAC_IRQHandler
#define USART3_4_IRQHandler            USART3_8_IRQHandler
#define USART3_6_IRQHandler            USART3_8_IRQHandler
#define PVD_IRQHandler                 VDDIO2_IRQHandler
#define PVD_VDDIO2_IRQHandler          VDDIO2_IRQHandler
#endif
/******************************************************************************/
/*  For a painless codes migration between the STM32F0xx device product       */
/*  lines, the aliases defined below are put in place to overcome the         */
/*  differences in the interrupt handlers and IRQn definitions.               */
/*  No need to update developed interrupt code when moving across             */
/*  product lines within the same STM32F0 Family                              */
/******************************************************************************/
#if defined(STM32F030x6)
/* Aliases for __IRQn */
#define ADC1_COMP_IRQn             ADC1_IRQn
#define DMA1_Ch1_IRQn              DMA1_Channel1_IRQn
#define DMA1_Ch2_3_DMA2_Ch1_2_IRQn DMA1_Channel2_3_IRQn
#define DMA1_Channel4_5_6_7_IRQn   DMA1_Channel4_5_IRQn
#define DMA1_Ch4_7_DMA2_Ch3_5_IRQn DMA1_Channel4_5_IRQn
#define RCC_CRS_IRQn               RCC_IRQn
/* Aliases for __IRQHandler */
#define ADC1_COMP_IRQHandler             ADC1_IRQHandler
#define DMA1_Ch1_IRQHandler              DMA1_Channel1_IRQHandler
#define DMA1_Ch2_3_DMA2_Ch1_2_IRQHandler DMA1_Channel2_3_IRQHandler
#define DMA1_Channel4_5_6_7_IRQHandler   DMA1_Channel4_5_IRQHandler
#define DMA1_Ch4_7_DMA2_Ch3_5_IRQHandler DMA1_Channel4_5_IRQHandler
#define RCC_CRS_IRQHandler               RCC_IRQHandler
#elif defined(STM32F030x8)
/* Aliases for __IRQn */
#define ADC1_COMP_IRQn             ADC1_IRQn
#define DMA1_Ch1_IRQn              DMA1_Channel1_IRQn
#define DMA1_Ch2_3_DMA2_Ch1_2_IRQn DMA1_Channel2_3_IRQn
#define DMA1_Channel4_5_6_7_IRQn   DMA1_Channel4_5_IRQn
#define DMA1_Ch4_7_DMA2_Ch3_5_IRQn DMA1_Channel4_5_IRQn
#define RCC_CRS_IRQn               RCC_IRQn
#define TIM6_DAC_IRQn              TIM6_IRQn
/* Aliases for __IRQHandler */
#define ADC1_COMP_IRQHandler             ADC1_IRQHandler
#define DMA1_Ch1_IRQHandler              DMA1_Channel1_IRQHandler
#define DMA1_Ch2_3_DMA2_Ch1_2_IRQHandler DMA1_Channel2_3_IRQHandler
#define DMA1_Channel4_5_6_7_IRQHandler   DMA1_Channel4_5_IRQHandler
#define DMA1_Ch4_7_DMA2_Ch3_5_IRQHandler DMA1_Channel4_5_IRQHandler
#define RCC_CRS_IRQHandler               RCC_IRQHandler
#define TIM6_DAC_IRQHandler              TIM6_IRQHandler
#elif defined(STM32F030xC)
/* Aliases for __IRQn */
#define ADC1_COMP_IRQn             ADC1_IRQn
#define DMA1_Ch1_IRQn              DMA1_Channel1_IRQn
#define DMA1_Ch2_3_DMA2_Ch1_2_IRQn DMA1_Channel2_3_IRQn
#define DMA1_Channel4_5_6_7_IRQn   DMA1_Channel4_5_IRQn
#define DMA1_Ch4_7_DMA2_Ch3_5_IRQn DMA1_Channel4_5_IRQn
#define RCC_CRS_IRQn               RCC_IRQn
#define TIM6_DAC_IRQn              TIM6_IRQn
#define USART3_4_IRQn              USART3_6_IRQn
#define USART3_8_IRQn              USART3_6_IRQn
/* Aliases for __IRQHandler */
#define ADC1_COMP_IRQHandler             ADC1_IRQHandler
#define DMA1_Ch1_IRQHandler              DMA1_Channel1_IRQHandler
#define DMA1_Ch2_3_DMA2_Ch1_2_IRQHandler DMA1_Channel2_3_IRQHandler
#define DMA1_Channel4_5_6_7_IRQHandler   DMA1_Channel4_5_IRQHandler
#define DMA1_Ch4_7_DMA2_Ch3_5_IRQHandler DMA1_Channel4_5_IRQHandler
#define RCC_CRS_IRQHandler               RCC_IRQHandler
#define TIM6_DAC_IRQHandler              TIM6_IRQHandler
#define USART3_4_IRQHandler              USART3_6_IRQHandler
#define USART3_8_IRQHandler              USART3_6_IRQHandler
#elif defined(STM32F031x6)
/* Aliases for __IRQn */
#define ADC1_COMP_IRQn             ADC1_IRQn
#define DMA1_Ch1_IRQn              DMA1_Channel1_IRQn
#define DMA1_Ch2_3_DMA2_Ch1_2_IRQn DMA1_Channel2_3_IRQn
#define DMA1_Channel4_5_6_7_IRQn   DMA1_Channel4_5_IRQn
#define DMA1_Ch4_7_DMA2_Ch3_5_IRQn DMA1_Channel4_5_IRQn
#define VDDIO2_IRQn                PVD_IRQn
#define PVD_VDDIO2_IRQn            PVD_IRQn
#define RCC_CRS_IRQn               RCC_IRQn
/* Aliases for __IRQHandler */
#define ADC1_COMP_IRQHandler             ADC1_IRQHandler
#define DMA1_Ch1_IRQHandler              DMA1_Channel1_IRQHandler
#define DMA1_Ch2_3_DMA2_Ch1_2_IRQHandler DMA1_Channel2_3_IRQHandler
#define DMA1_Channel4_5_6_7_IRQHandler   DMA1_Channel4_5_IRQHandler
#define DMA1_Ch4_7_DMA2_Ch3_5_IRQHandler DMA1_Channel4_5_IRQHandler
#define VDDIO2_IRQHandler                PVD_IRQHandler
#define PVD_VDDIO2_IRQHandler            PVD_IRQHandler
#define RCC_CRS_IRQHandler               RCC_IRQHandler
#elif defined(STM32F038xx)
/* Aliases for __IRQn */
#define ADC1_COMP_IRQn             ADC1_IRQn
#define DMA1_Ch1_IRQn              DMA1_Channel1_IRQn
#define DMA1_Ch2_3_DMA2_Ch1_2_IRQn DMA1_Channel2_3_IRQn
#define DMA1_Channel4_5_6_7_IRQn   DMA1_Channel4_5_IRQn
#define DMA1_Ch4_7_DMA2_Ch3_5_IRQn DMA1_Channel4_5_IRQn
#define RCC_CRS_IRQn               RCC_IRQn
/* Aliases for __IRQHandler */
#define ADC1_COMP_IRQHandler             ADC1_IRQHandler
#define DMA1_Ch1_IRQHandler              DMA1_Channel1_IRQHandler
#define DMA1_Ch2_3_DMA2_Ch1_2_IRQHandler DMA1_Channel2_3_IRQHandler
#define DMA1_Channel4_5_6_7_IRQHandler   DMA1_Channel4_5_IRQHandler
#define DMA1_Ch4_7_DMA2_Ch3_5_IRQHandler DMA1_Channel4_5_IRQHandler
#define RCC_CRS_IRQHandler               RCC_IRQHandler
#elif defined(STM32F042x6)
/* Aliases for __IRQn */
#define ADC1_COMP_IRQn             ADC1_IRQn
#define DMA1_Ch1_IRQn              DMA1_Channel1_IRQn
#define DMA1_Ch2_3_DMA2_Ch1_2_IRQn DMA1_Channel2_3_IRQn
#define DMA1_Channel4_5_6_7_IRQn   DMA1_Channel4_5_IRQn
#define DMA1_Ch4_7_DMA2_Ch3_5_IRQn DMA1_Channel4_5_IRQn
#define PVD_IRQn                   PVD_VDDIO2_IRQn
#define VDDIO2_IRQn                PVD_VDDIO2_IRQn
#define RCC_IRQn                   RCC_CRS_IRQn
/* Aliases for __IRQHandler */
#define ADC1_COMP_IRQHandler             ADC1_IRQHandler
#define DMA1_Ch1_IRQHandler              DMA1_Channel1_IRQHandler
#define DMA1_Ch2_3_DMA2_Ch1_2_IRQHandler DMA1_Channel2_3_IRQHandler
#define DMA1_Channel4_5_6_7_IRQHandler   DMA1_Channel4_5_IRQHandler
#define DMA1_Ch4_7_DMA2_Ch3_5_IRQHandler DMA1_Channel4_5_IRQHandler
#define PVD_IRQHandler                   PVD_VDDIO2_IRQHandler
#define VDDIO2_IRQHandler                PVD_VDDIO2_IRQHandler
#define RCC_IRQHandler                   RCC_CRS_IRQHandler
#elif defined(STM32F048xx)
/* Aliases for __IRQn */
#define ADC1_COMP_IRQn             ADC1_IRQn
#define DMA1_Ch1_IRQn              DMA1_Channel1_IRQn
#define DMA1_Ch2_3_DMA2_Ch1_2_IRQn DMA1_Channel2_3_IRQn
#define DMA1_Channel4_5_6_7_IRQn   DMA1_Channel4_5_IRQn
#define DMA1_Ch4_7_DMA2_Ch3_5_IRQn DMA1_Channel4_5_IRQn
#define RCC_IRQn                   RCC_CRS_IRQn
#define PVD_IRQn                   VDDIO2_IRQn
#define PVD_VDDIO2_IRQn            VDDIO2_IRQn
/* Aliases for __IRQHandler */
#define ADC1_COMP_IRQHandler             ADC1_IRQHandler
#define DMA1_Ch1_IRQHandler              DMA1_Channel1_IRQHandler
#define DMA1_Ch2_3_DMA2_Ch1_2_IRQHandler DMA1_Channel2_3_IRQHandler
#define DMA1_Channel4_5_6_7_IRQHandler   DMA1_Channel4_5_IRQHandler
#define DMA1_Ch4_7_DMA2_Ch3_5_IRQHandler DMA1_Channel4_5_IRQHandler
#define RCC_IRQHandler                   RCC_CRS_IRQHandler
#define PVD_IRQHandler                   VDDIO2_IRQHandler
#define PVD_VDDIO2_IRQHandler            VDDIO2_IRQHandler
#elif defined(STM32F051x8)
/* Aliases for __IRQn */
#define ADC1_IRQn                  ADC1_COMP_IRQn
#define DMA1_Ch1_IRQn              DMA1_Channel1_IRQn
#define DMA1_Ch2_3_DMA2_Ch1_2_IRQn DMA1_Channel2_3_IRQn
#define DMA1_Channel4_5_6_7_IRQn   DMA1_Channel4_5_IRQn
#define DMA1_Ch4_7_DMA2_Ch3_5_IRQn DMA1_Channel4_5_IRQn
#define VDDIO2_IRQn                PVD_IRQn
#define PVD_VDDIO2_IRQn            PVD_IRQn
#define RCC_CRS_IRQn               RCC_IRQn
#define TIM6_IRQn                  TIM6_DAC_IRQn
/* Aliases for __IRQHandler */
#define ADC1_IRQHandler                  ADC1_COMP_IRQHandler
#define DMA1_Ch1_IRQHandler              DMA1_Channel1_IRQHandler
#define DMA1_Ch2_3_DMA2_Ch1_2_IRQHandler DMA1_Channel2_3_IRQHandler
#define DMA1_Channel4_5_6_7_IRQHandler   DMA1_Channel4_5_IRQHandler
#define DMA1_Ch4_7_DMA2_Ch3_5_IRQHandler DMA1_Channel4_5_IRQHandler
#define VDDIO2_IRQHandler                PVD_IRQHandler
#define PVD_VDDIO2_IRQHandler            PVD_IRQHandler
#define RCC_CRS_IRQHandler               RCC_IRQHandler
#define TIM6_IRQHandler                  TIM6_DAC_IRQHandler
#elif defined(STM32F058xx)
/* Aliases for __IRQn */
#define ADC1_IRQn                  ADC1_COMP_IRQn
#define DMA1_Ch1_IRQn              DMA1_Channel1_IRQn
#define DMA1_Ch2_3_DMA2_Ch1_2_IRQn DMA1_Channel2_3_IRQn
#define DMA1_Channel4_5_6_7_IRQn   DMA1_Channel4_5_IRQn
#define DMA1_Ch4_7_DMA2_Ch3_5_IRQn DMA1_Channel4_5_IRQn
#define RCC_CRS_IRQn               RCC_IRQn
#define TIM6_IRQn                  TIM6_DAC_IRQn
/* Aliases for __IRQHandler */
#define ADC1_IRQHandler                  ADC1_COMP_IRQHandler
#define DMA1_Ch1_IRQHandler              DMA1_Channel1_IRQHandler
#define DMA1_Ch2_3_DMA2_Ch1_2_IRQHandler DMA1_Channel2_3_IRQHandler
#define DMA1_Channel4_5_6_7_IRQHandler   DMA1_Channel4_5_IRQHandler
#define DMA1_Ch4_7_DMA2_Ch3_5_IRQHandler DMA1_Channel4_5_IRQHandler
#define RCC_CRS_IRQHandler               RCC_IRQHandler
#define TIM6_IRQHandler                  TIM6_DAC_IRQHandler
#elif defined(STM32F070x6)
/* Aliases for __IRQn */
#define ADC1_COMP_IRQn             ADC1_IRQn
#define DMA1_Ch1_IRQn              DMA1_Channel1_IRQn
#define DMA1_Ch2_3_DMA2_Ch1_2_IRQn DMA1_Channel2_3_IRQn
#define DMA1_Channel4_5_6_7_IRQn   DMA1_Channel4_5_IRQn
#define DMA1_Ch4_7_DMA2_Ch3_5_IRQn DMA1_Channel4_5_IRQn
#define RCC_CRS_IRQn               RCC_IRQn
/* Aliases for __IRQHandler */
#define ADC1_COMP_IRQHandler             ADC1_IRQHandler
#define DMA1_Ch1_IRQHandler              DMA1_Channel1_IRQHandler
#define DMA1_Ch2_3_DMA2_Ch1_2_IRQHandler DMA1_Channel2_3_IRQHandler
#define DMA1_Channel4_5_6_7_IRQHandler   DMA1_Channel4_5_IRQHandler
#define DMA1_Ch4_7_DMA2_Ch3_5_IRQHandler DMA1_Channel4_5_IRQHandler
#define RCC_CRS_IRQHandler               RCC_IRQHandler
#elif defined(STM32F070xB)
/* Aliases for __IRQn */
#define ADC1_COMP_IRQn             ADC1_IRQn
#define DMA1_Ch1_IRQn              DMA1_Channel1_IRQn
#define DMA1_Ch2_3_DMA2_Ch1_2_IRQn DMA1_Channel2_3_IRQn
#define DMA1_Channel4_5_6_7_IRQn   DMA1_Channel4_5_IRQn
#define DMA1_Ch4_7_DMA2_Ch3_5_IRQn DMA1_Channel4_5_IRQn
#define RCC_CRS_IRQn               RCC_IRQn
#define TIM6_DAC_IRQn              TIM6_IRQn
#define USART3_6_IRQn              USART3_4_IRQn
#define USART3_8_IRQn              USART3_4_IRQn
/* Aliases for __IRQHandler */
#define ADC1_COMP_IRQHandler             ADC1_IRQHandler
#define DMA1_Ch1_IRQHandler              DMA1_Channel1_IRQHandler
#define DMA1_Ch2_3_DMA2_Ch1_2_IRQHandler DMA1_Channel2_3_IRQHandler
#define DMA1_Channel4_5_6_7_IRQHandler   DMA1_Channel4_5_IRQHandler
#define DMA1_Ch4_7_DMA2_Ch3_5_IRQHandler DMA1_Channel4_5_IRQHandler
#define RCC_CRS_IRQHandler               RCC_IRQHandler
#define TIM6_DAC_IRQHandler              TIM6_IRQHandler
#define USART3_6_IRQHandler              USART3_4_IRQHandler
#define USART3_8_IRQHandler              USART3_4_IRQHandler
#elif defined(STM32F071xB)
/* Aliases for __IRQn */
#define ADC1_IRQn                  ADC1_COMP_IRQn
#define DMA1_Ch1_IRQn              DMA1_Channel1_IRQn
#define DMA1_Ch2_3_DMA2_Ch1_2_IRQn DMA1_Channel2_3_IRQn
#define DMA1_Ch4_7_DMA2_Ch3_5_IRQn DMA1_Channel4_5_6_7_IRQn
#define DMA1_Channel4_5_IRQn       DMA1_Channel4_5_6_7_IRQn
#define PVD_IRQn                   PVD_VDDIO2_IRQn
#define VDDIO2_IRQn                PVD_VDDIO2_IRQn
#define RCC_IRQn                   RCC_CRS_IRQn
#define TIM6_IRQn                  TIM6_DAC_IRQn
#define USART3_6_IRQn              USART3_4_IRQn
#define USART3_8_IRQn              USART3_4_IRQn
/* Aliases for __IRQHandler */
#define ADC1_IRQHandler                  ADC1_COMP_IRQHandler
#define DMA1_Ch1_IRQHandler              DMA1_Channel1_IRQHandler
#define DMA1_Ch2_3_DMA2_Ch1_2_IRQHandler DMA1_Channel2_3_IRQHandler
#define DMA1_Ch4_7_DMA2_Ch3_5_IRQHandler DMA1_Channel4_5_6_7_IRQHandler
#define DMA1_Channel4_5_IRQHandler       DMA1_Channel4_5_6_7_IRQHandler
#define PVD_IRQHandler                   PVD_VDDIO2_IRQHandler
#define VDDIO2_IRQHandler                PVD_VDDIO2_IRQHandler
#define RCC_IRQHandler                   RCC_CRS_IRQHandler
#define TIM6_IRQHandler                  TIM6_DAC_IRQHandler
#define USART3_6_IRQHandler              USART3_4_IRQHandler
#define USART3_8_IRQHandler              USART3_4_IRQHandler
#elif defined(STM32F072xB)
/* Aliases for __IRQn */
#define ADC1_IRQn                  ADC1_COMP_IRQn
#define DMA1_Ch1_IRQn              DMA1_Channel1_IRQn
#define DMA1_Ch2_3_DMA2_Ch1_2_IRQn DMA1_Channel2_3_IRQn
#define DMA1_Ch4_7_DMA2_Ch3_5_IRQn DMA1_Channel4_5_6_7_IRQn
#define DMA1_Channel4_5_IRQn       DMA1_Channel4_5_6_7_IRQn
#define PVD_IRQn                   PVD_VDDIO2_IRQn
#define VDDIO2_IRQn                PVD_VDDIO2_IRQn
#define RCC_IRQn                   RCC_CRS_IRQn
#define TIM6_IRQn                  TIM6_DAC_IRQn
#define USART3_6_IRQn              USART3_4_IRQn
#define USART3_8_IRQn              USART3_4_IRQn
/* Aliases for __IRQHandler */
#define ADC1_IRQHandler                  ADC1_COMP_IRQHandler
#define DMA1_Ch1_IRQHandler              DMA1_Channel1_IRQHandler
#define DMA1_Ch2_3_DMA2_Ch1_2_IRQHandler DMA1_Channel2_3_IRQHandler
#define DMA1_Ch4_7_DMA2_Ch3_5_IRQHandler DMA1_Channel4_5_6_7_IRQHandler
#define DMA1_Channel4_5_IRQHandler       DMA1_Channel4_5_6_7_IRQHandler
#define PVD_IRQHandler                   PVD_VDDIO2_IRQHandler
#define VDDIO2_IRQHandler                PVD_VDDIO2_IRQHandler
#define RCC_IRQHandler                   RCC_CRS_IRQHandler
#define TIM6_IRQHandler                  TIM6_DAC_IRQHandler
#define USART3_6_IRQHandler              USART3_4_IRQHandler
#define USART3_8_IRQHandler              USART3_4_IRQHandler
#elif defined(STM32F078xx)
/* Aliases for __IRQn */
#define ADC1_IRQn                  ADC1_COMP_IRQn
#define DMA1_Ch1_IRQn              DMA1_Channel1_IRQn
#define DMA1_Ch2_3_DMA2_Ch1_2_IRQn DMA1_Channel2_3_IRQn
#define DMA1_Ch4_7_DMA2_Ch3_5_IRQn DMA1_Channel4_5_6_7_IRQn
#define DMA1_Channel4_5_IRQn       DMA1_Channel4_5_6_7_IRQn
#define RCC_IRQn                   RCC_CRS_IRQn
#define TIM6_IRQn                  TIM6_DAC_IRQn
#define USART3_6_IRQn              USART3_4_IRQn
#define USART3_8_IRQn              USART3_4_IRQn
#define PVD_IRQn                   VDDIO2_IRQn
#define PVD_VDDIO2_IRQn            VDDIO2_IRQn
/* Aliases for __IRQHandler */
#define ADC1_IRQHandler                  ADC1_COMP_IRQHandler
#define DMA1_Ch1_IRQHandler              DMA1_Channel1_IRQHandler
#define DMA1_Ch2_3_DMA2_Ch1_2_IRQHandler DMA1_Channel2_3_IRQHandler
#define DMA1_Ch4_7_DMA2_Ch3_5_IRQHandler DMA1_Channel4_5_6_7_IRQHandler
#define DMA1_Channel4_5_IRQHandler       DMA1_Channel4_5_6_7_IRQHandler
#define RCC_IRQHandler                   RCC_CRS_IRQHandler
#define TIM6_IRQHandler                  TIM6_DAC_IRQHandler
#define USART3_6_IRQHandler              USART3_4_IRQHandler
#define USART3_8_IRQHandler              USART3_4_IRQHandler
#define PVD_IRQHandler                   VDDIO2_IRQHandler
#define PVD_VDDIO2_IRQHandler            VDDIO2_IRQHandler
#elif defined(STM32F091xC)
/* Aliases for __IRQn */
#define ADC1_IRQn                ADC1_COMP_IRQn
#define DMA1_Channel1_IRQn       DMA1_Ch1_IRQn
#define DMA1_Channel2_3_IRQn     DMA1_Ch2_3_DMA2_Ch1_2_IRQn
#define DMA1_Channel4_5_6_7_IRQn DMA1_Ch4_7_DMA2_Ch3_5_IRQn
#define DMA1_Channel4_5_IRQn     DMA1_Ch4_7_DMA2_Ch3_5_IRQn
#define PVD_IRQn                 PVD_VDDIO2_IRQn
#define VDDIO2_IRQn              PVD_VDDIO2_IRQn
#define RCC_IRQn                 RCC_CRS_IRQn
#define TIM6_IRQn                TIM6_DAC_IRQn
#define USART3_4_IRQn            USART3_8_IRQn
#define USART3_6_IRQn            USART3_8_IRQn
/* Aliases for __IRQHandler */
#define ADC1_IRQHandler                ADC1_COMP_IRQHandler
#define DMA1_Channel1_IRQHandler       DMA1_Ch1_IRQHandler
#define DMA1_Channel2_3_IRQHandler     DMA1_Ch2_3_DMA2_Ch1_2_IRQHandler
#define DMA1_Channel4_5_6_7_IRQHandler DMA1_Ch4_7_DMA2_Ch3_5_IRQHandler
#define DMA1_Channel4_5_IRQHandler     DMA1_Ch4_7_DMA2_Ch3_5_IRQHandler
#define PVD_IRQHandler                 PVD_VDDIO2_IRQHandler
#define VDDIO2_IRQHandler              PVD_VDDIO2_IRQHandler
#define RCC_IRQHandler                 RCC_CRS_IRQHandler
#define TIM6_IRQHandler                TIM6_DAC_IRQHandler
#define USART3_4_IRQHandler            USART3_8_IRQHandler
#define USART3_6_IRQHandler            USART3_8_IRQHandler
#elif defined(STM32F098xx)
/* Aliases for __IRQn */
#define ADC1_IRQn                ADC1_COMP_IRQn
#define DMA1_Channel1_IRQn       DMA1_Ch1_IRQn
#define DMA1_Channel2_3_IRQn     DMA1_Ch2_3_DMA2_Ch1_2_IRQn
#define DMA1_Channel4_5_6_7_IRQn DMA1_Ch4_7_DMA2_Ch3_5_IRQn
#define DMA1_Channel4_5_IRQn     DMA1_Ch4_7_DMA2_Ch3_5_IRQn
#define RCC_IRQn                 RCC_CRS_IRQn
#define TIM6_IRQn                TIM6_DAC_IRQn
#define USART3_4_IRQn            USART3_8_IRQn
#define USART3_6_IRQn            USART3_8_IRQn
#define PVD_IRQn                 VDDIO2_IRQn
#define PVD_VDDIO2_IRQn          VDDIO2_IRQn
/* Aliases for __IRQHandler */
#define ADC1_IRQHandler                ADC1_COMP_IRQHandler
#define DMA1_Channel1_IRQHandler       DMA1_Ch1_IRQHandler
#define DMA1_Channel2_3_IRQHandler     DMA1_Ch2_3_DMA2_Ch1_2_IRQHandler
#define DMA1_Channel4_5_6_7_IRQHandler DMA1_Ch4_7_DMA2_Ch3_5_IRQHandler
#define DMA1_Channel4_5_IRQHandler     DMA1_Ch4_7_DMA2_Ch3_5_IRQHandler
#define RCC_IRQHandler                 RCC_CRS_IRQHandler
#define TIM6_IRQHandler                TIM6_DAC_IRQHandler
#define USART3_4_IRQHandler            USART3_8_IRQHandler
#define USART3_6_IRQHandler            USART3_8_IRQHandler
#define PVD_IRQHandler                 VDDIO2_IRQHandler
#define PVD_VDDIO2_IRQHandler          VDDIO2_IRQHandler
#endif

#include "core_cm0.h"            /* Cortex-M0 processor and core peripherals */
#include "system_stm32f0xx.h"    /* STM32F0xx System Header */
#include <stdint.h>
